Grooming/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Номенклатура</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>Материалы</name>
      <description>Материалы</description>
    </items>
    <items>
      <name>Товары</name>
      <description>Товары</description>
    </items>
    <items>
      <name>Услуги</name>
      <description>Услуги</description>
    </items>
  </predefined>
  <attributes>
    <name>ТипНоменклатуры</name>
    <type>
      <types>EnumRef.ТипыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокГодности</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяЗатрат</name>
    <type>
      <types>CatalogRef.СтатьиЗатрат</types>
    </type>
  </attributes>
  <attributes>
    <name>ДлительностьУслуги</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Grooming/src/Enums/ТипыНоменклатуры/ТипыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыНоменклатуры</name>
  <enumValues>
    <name>Услуга</name>
  </enumValues>
  <enumValues>
    <name>Товар</name>
  </enumValues>
  <enumValues>
    <name>Материал</name>
  </enumValues>
</mdclass:Enum>

Grooming/src/Catalogs/Номенклатура/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура ТипНоменклатурыПриИзменении(Элемент)
	УстановитьВидимостьДляУслуги();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимостьДляУслуги();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ Объект.Ссылка.Пустая() Тогда		ТекущаяРозничнаяЦена = РаботаСЦенамиВызовСервера.ПолучитьЦенуПродажиНаДату(Объект.Ссылка);	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьЦену(Команда)
	Если Объект.Ссылка.Пустая() Тогда		Сообщить("Перед установкой цены необходимо записать документ!");	Иначе		ОткрытьФорму("Справочник.Номенклатура.Форма.ФормаСозданияЦены",
			Новый Структура("Номенклатура", Объект.Ссылка),,,,, 
			Новый ОписаниеОповещения("ПослеИзмененияЦены", ЭтаФорма),
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 	КонецЕсли;
КонецПроцедуры   

&НаКлиентеПроцедура ПослеИзмененияЦены(Результат, ДополнительныеПараметры) Экспорт    	ТекущаяРозничнаяЦена =  РаботаСЦенамиВызовСервера.ПолучитьЦенуПродажиНаДату(Объект.Ссылка);КонецПроцедуры 

&НаКлиенте
Процедура УстановитьВидимостьДляУслуги()     
	Если Объект.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Услуга") Тогда  
		Элементы.СрокГодности.Видимость = Ложь; 
		Элементы.ДлительностьУслуги.Видимость = Истина;
	Иначе
		Элементы.СрокГодности.Видимость = Истина;
		Элементы.ДлительностьУслуги.Видимость = Ложь;
	КонецЕсли
КонецПроцедуры
